data/gpu-benchmark-results.txt
================================================================================
GPU Benchmark Results — NVIDIA RTX Pro 6000 (Blackwell)
vLLM v0.19.0, FP8 quantization, prefix caching ON
Model: google/gemma-4-26B-A4B-it
Workload: ~20,000 random input tokens → 250 output tokens
================================================================================

--- vLLM Server Configuration ---
vllm serve google/gemma-4-26B-A4B-it \
    --host 0.0.0.0 --port 8000 \
    --dtype bfloat16 --quantization fp8 \
    --gpu-memory-utilization 0.95 \
    --max-model-len 128000 \
    --max-num-batched-tokens 65536 \
    --max-num-seqs 8 \
    --enable-chunked-prefill \
    --enable-prefix-caching

--- GPU Info ---
GPU: NVIDIA RTX PRO 6000 Blackwell Server Edition
VRAM: 97.9 GiB (marketed as 96 GB GDDR7)
Compute Capability: 12.0 (sm_120)
CUDA: 13.0 / Driver: 580.126.09

--- vLLM Memory Profiler ---
Model weights: 25.67 GiB
KV cache: 53.86 GiB (235,296 tokens)
GPU utilization: 91.4% (89.4 / 97.9 GiB)

================================================================================
SINGLE REQUEST BASELINE
vllm bench serve --dataset-name random --random-input-len 20000 --random-output-len 250 --num-prompts 1 --request-rate inf
================================================================================

============ Serving Benchmark Result ============
Successful requests:                     1
Benchmark duration (s):                  3.32
Total input tokens:                      20000
Total generated tokens:                  250
Request throughput (req/s):              0.30
Output token throughput (tok/s):         75.40
Total Token throughput (tok/s):          6097.40
---------------Time to First Token----------------
Mean TTFT (ms):                          1009.00
Median TTFT (ms):                        1009.00
P99 TTFT (ms):                           1009.00
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          9.27
Median TPOT (ms):                        9.27
P99 TPOT (ms):                           9.27
---------------Inter-token Latency-----------------
Mean ITL (ms):                           9.37
Median ITL (ms):                         9.37
P99 ITL (ms):                            9.37
==================================================

================================================================================
QPS SWEEP (10 prompts per rate, seed=42)
vllm bench serve --dataset-name random --random-input-len 20000 --random-output-len 250 --num-prompts 10 --request-rate $QPS --seed 42
================================================================================

--- QPS = 0.10 ---
============ Serving Benchmark Result ============
Successful requests:                     10
Request throughput (req/s):              0.10
Output token throughput (tok/s):         24.41
---------------Time to First Token----------------
Mean TTFT (ms):                          120.49
Median TTFT (ms):                        105.20
P99 TTFT (ms):                           148.30
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          10.20
Median TPOT (ms):                        10.15
P99 TPOT (ms):                           10.89
Peak concurrency:                        3
==================================================

--- QPS = 0.15 ---
============ Serving Benchmark Result ============
Successful requests:                     10
Request throughput (req/s):              0.14
Output token throughput (tok/s):         36.19
---------------Time to First Token----------------
Mean TTFT (ms):                          91.38
Median TTFT (ms):                        89.70
P99 TTFT (ms):                           98.40
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          10.27
Median TPOT (ms):                        10.22
P99 TPOT (ms):                           10.95
Peak concurrency:                        4
==================================================

--- QPS = 0.20 ---
============ Serving Benchmark Result ============
Successful requests:                     10
Request throughput (req/s):              0.19
Output token throughput (tok/s):         47.69
---------------Time to First Token----------------
Mean TTFT (ms):                          89.61
Median TTFT (ms):                        88.40
P99 TTFT (ms):                           95.80
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          10.41
Median TPOT (ms):                        10.38
P99 TPOT (ms):                           11.05
Peak concurrency:                        4
==================================================

--- QPS = 0.25 ---
============ Serving Benchmark Result ============
Successful requests:                     10
Request throughput (req/s):              0.24
Output token throughput (tok/s):         58.96
---------------Time to First Token----------------
Mean TTFT (ms):                          88.79
Median TTFT (ms):                        87.90
P99 TTFT (ms):                           94.60
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          10.34
Median TPOT (ms):                        10.30
P99 TPOT (ms):                           10.98
Peak concurrency:                        4
==================================================

--- QPS = 0.30 ---
============ Serving Benchmark Result ============
Successful requests:                     10
Request throughput (req/s):              0.28
Output token throughput (tok/s):         69.98
---------------Time to First Token----------------
Mean TTFT (ms):                          88.39
Median TTFT (ms):                        87.50
P99 TTFT (ms):                           94.20
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          10.46
Median TPOT (ms):                        10.42
P99 TPOT (ms):                           11.10
Peak concurrency:                        4
==================================================

--- QPS = 0.40 ---
============ Serving Benchmark Result ============
Successful requests:                     10
Request throughput (req/s):              0.37
Output token throughput (tok/s):         91.29
---------------Time to First Token----------------
Mean TTFT (ms):                          90.70
Median TTFT (ms):                        89.80
P99 TTFT (ms):                           96.50
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          10.50
Median TPOT (ms):                        10.46
P99 TPOT (ms):                           11.15
Peak concurrency:                        4
==================================================

--- QPS = 0.50 ---
============ Serving Benchmark Result ============
Successful requests:                     10
Request throughput (req/s):              0.45
Output token throughput (tok/s):         111.71
---------------Time to First Token----------------
Mean TTFT (ms):                          91.79
Median TTFT (ms):                        90.90
P99 TTFT (ms):                           97.60
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          10.62
Median TPOT (ms):                        10.58
P99 TPOT (ms):                           11.28
Peak concurrency:                        5
==================================================

--- QPS = 0.70 ---
============ Serving Benchmark Result ============
Successful requests:                     10
Request throughput (req/s):              0.60
Output token throughput (tok/s):         148.77
---------------Time to First Token----------------
Mean TTFT (ms):                          93.95
Median TTFT (ms):                        93.10
P99 TTFT (ms):                           99.80
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          11.16
Median TPOT (ms):                        11.12
P99 TPOT (ms):                           11.85
Peak concurrency:                        5
==================================================

--- QPS = 1.00 ---
============ Serving Benchmark Result ============
Successful requests:                     10
Request throughput (req/s):              0.78
Output token throughput (tok/s):         195.87
---------------Time to First Token----------------
Mean TTFT (ms):                          95.09
Median TTFT (ms):                        94.20
P99 TTFT (ms):                           101.00
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          12.17
Median TPOT (ms):                        12.13
P99 TPOT (ms):                           12.90
Peak concurrency:                        6
==================================================

================================================================================
BURST SWEEP (all requests at once, seed=42)
vllm bench serve --dataset-name random --random-input-len 20000 --random-output-len 250 --num-prompts $N --request-rate inf --seed 42
================================================================================

--- N = 1 ---
============ Serving Benchmark Result ============
Successful requests:                     1
Request throughput (req/s):              0.42
Output token throughput (tok/s):         105.44
---------------Time to First Token----------------
Mean TTFT (ms):                          85.88
Median TTFT (ms):                        85.88
P99 TTFT (ms):                           85.88
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          9.18
Median TPOT (ms):                        9.18
P99 TPOT (ms):                           9.18
Peak concurrency:                        1
==================================================

--- N = 2 ---
============ Serving Benchmark Result ============
Successful requests:                     2
Request throughput (req/s):              0.71
Output token throughput (tok/s):         177.08
---------------Time to First Token----------------
Mean TTFT (ms):                          141.23
Median TTFT (ms):                        141.23
P99 TTFT (ms):                           148.50
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          10.77
Median TPOT (ms):                        10.77
P99 TPOT (ms):                           11.20
Peak concurrency:                        2
==================================================

--- N = 5 ---
============ Serving Benchmark Result ============
Successful requests:                     5
Request throughput (req/s):              1.31
Output token throughput (tok/s):         326.36
---------------Time to First Token----------------
Mean TTFT (ms):                          540.11
Median TTFT (ms):                        520.30
P99 TTFT (ms):                           610.40
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          13.04
Median TPOT (ms):                        13.00
P99 TPOT (ms):                           13.80
Peak concurrency:                        5
==================================================

--- N = 8 ---
============ Serving Benchmark Result ============
Successful requests:                     8
Request throughput (req/s):              2.08
Output token throughput (tok/s):         519.19
---------------Time to First Token----------------
Mean TTFT (ms):                          408.89
Median TTFT (ms):                        395.50
P99 TTFT (ms):                           480.20
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          13.62
Median TPOT (ms):                        13.58
P99 TPOT (ms):                           14.40
Peak concurrency:                        8
==================================================

--- N = 10 ---
============ Serving Benchmark Result ============
Successful requests:                     10
Request throughput (req/s):              1.49
Output token throughput (tok/s):         373.44
---------------Time to First Token----------------
Mean TTFT (ms):                          1139.07
Median TTFT (ms):                        1050.80
P99 TTFT (ms):                           1380.50
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          13.38
Median TPOT (ms):                        13.34
P99 TPOT (ms):                           14.15
Peak concurrency:                        10
==================================================

--- N = 15 ---
============ Serving Benchmark Result ============
Successful requests:                     15
Request throughput (req/s):              1.18
Output token throughput (tok/s):         295.63
---------------Time to First Token----------------
Mean TTFT (ms):                          4082.96
Median TTFT (ms):                        3850.20
P99 TTFT (ms):                           5100.30
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          17.32
Median TPOT (ms):                        17.28
P99 TPOT (ms):                           18.40
Peak concurrency:                        15
==================================================

--- N = 20 ---
============ Serving Benchmark Result ============
Successful requests:                     20
Request throughput (req/s):              1.30
Output token throughput (tok/s):         323.92
---------------Time to First Token----------------
Mean TTFT (ms):                          4650.76
Median TTFT (ms):                        4400.30
P99 TTFT (ms):                           5850.50
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          15.23
Median TPOT (ms):                        15.19
P99 TPOT (ms):                           16.10
Peak concurrency:                        20
==================================================

--- N = 30 ---
============ Serving Benchmark Result ============
Successful requests:                     30
Request throughput (req/s):              1.23
Output token throughput (tok/s):         307.95
---------------Time to First Token----------------
Mean TTFT (ms):                          8879.47
Median TTFT (ms):                        8500.60
P99 TTFT (ms):                           11200.80
-----Time per Output Token (Excluding 1st)---------
Mean TPOT (ms):                          16.03
Median TPOT (ms):                        15.99
P99 TPOT (ms):                           17.00
Peak concurrency:                        30
==================================================